{
  "en": {
    "name": "Yurii Solodovnyk",
    "fullStack": "Full-Stack",
    "developer": "Developer",
    "resume": "Résumé",
    "aboutMe": "Developer with hands-on experience in building and maintaining enterprise-level applications using .NET and Angular. I have skills in performance optimization, external system integrations, and migration of legacy systems to modern architectures. Understanding of scalable monolithic design, backend infrastructure, and frontend bottlenecks. Practical, result-oriented, and always looking to improve both product and process.",
    "experience": "Experience",
    "now": "Now",
    "th": "th",
    "october": "October",
    "present": "present",
    "workingIn": "Working in",
    "as": "as",
    "st": "st",
    "rd": "rd",
    "clarifyRequirements": "Clarification of complex business requirements and transformed them into technical solutions",
    "taskDefinitionMonolith": "Definition and implementation tasks for a large monolith project (.NET + Angular)",
    "performanceOptimization": "Frontend and backend performance optimization (profiling, Redis caching, SQL tuning)",
    "migrationDotNet": "Migration from .NET Framework to .NET 8",
    "externalApi": "Developing and supporting external APIs and integrations (Stripe, HubSpot, Mailchimp, etc.)",
    "studentAt": "Student at",
    "bachelorStudentAt": "Bachelor's student at",
    "masterStudentAt": "Master's student at",
    "nure": "Kharkiv National University of Radio Electronics",
    "faculty": "Faculty of Computer Engineering and Management,",
    "specialty": "specialty Computer Engineering.",
    "notToBeConfused": "not to be confused with the name of the faculty",
    "specialtyMaster": "specialty Computer Engineering (Specialized Computer Systems).",
    "advancedKnowledgeInComputerEngineering": "Advanced knowledge in computer engineering, including AI methods, data analysis, and system/network design.",
    "practicalSkillsInSolving": "Practical skills in solving engineering problems, modeling systems, analyzing information, and implementing projects.",
    "criticalThinking": "Critical thinking and decision-making abilities, with clear communication of ideas in academic settings in both Ukrainian and a foreign language.",
    "enterpriseProjectDevelopment": "Enterprise project development for large-scale systems.",
    "teamCollaboration": "Team collaboration and using tools for seamless workflow management.",
    "deadlines": "Deadlines and MVP, task prioritization, incremental development, creating core functionality.",
    "fundamentalTheoreticalKnowledge": "Fundamental theoretical knowledge of computer systems, networks, and technologies, including current advancements in computer engineering.",
    "understandingOfPracticalAspects": "Understanding of practical aspects, such as technical specifications, modelling, conducting experiments, and solving engineering problems.",
    "abilityToAssess": "Ability to assess the impact of technical solutions in social, economic, and environmental contexts, along with knowledge of basic economics and project management.",
    "basicProgrammingSkills": "Basic programming skills: algorithmic thinking, knowledge of programming languages, OOP, and fundamentals of software development.",
    "backThen": "Back then",
    "june": "June",
    "september": "September",
    "february": "February",
    "bsa": "Binary Studio Academy",
    "lyceum": "Panyutyn Lyceum",
    "wayBackThen": "Way back then",
    "july": "July",
    "born": "Born",
    "inTheTown": "in the town of",
    "panyutyne": "Panyutyne",
    "ukraine": "Ukraine",
    "location": "Location",
    "problemSolving": "Problem-solving.",
    "teamworkAndCommunication": "Teamwork and communication.",
    "timeManagement": "Time management.",
    "skills": "Skills",
    "frontendSkills": "Frontend: Angular, JavaScript/TypeScript, HTML5/CSS3/SASS.",
    "backendSkills": "Backend: .NET, ASP.NET Core, EF Core + LINQ, Redis, T-SQL, MongoDb.",
    "softSkills": "Soft skills: Teamwork and Collaboration, Effective Communication, Problem Solving, Time Management, Adaptability, Critical Thinking, Attention to Detail, Conflict Resolution",
    "character": "Character",
    "characterTraits": "DISCIPLINED CONSCIENTIOUS RATIONAL CONSISTENT CURIOUS LOW-EMOTIONAL CALM STUBBORN COMPETITIVE PROCRASTINATOR RELEVANT",
    "likes": "Likes",
    "likesDescription": "GOOD FOOD BAD FOOD FOOTBALL VOLLEYBALL BASKETBALL RUNNING ROCK DOGS TRAVELING FILMS",
    "dislikes": "Dislikes",
    "dislikesDescription": "ARROGANT PEOPLE INJUSTICE ANNOYANCE BALD CATS DRUGS HYPOCRISY",
    "wants": "Wants",
    "wantsDescription": "START MY OWN SOFTWARE DEVELOPMENT COMPANY, BE A PROFESSIONAL IN MY FIELD, BE A WELL EDUCATED PERSON, FLY TO MARS",
    "education": "Education",
    "everyDay": "Every day",
    "everyDayDescription": "Frontend, Backend, English",
    "spentInKindergarten": "Spent in kindergarten like an ordinary child",
    "articles": "Articles",
    "article1Title": "SMART LIGHTING CONTROL SYSTEM FOR INDOOR SPACES BASED ON ARDUINO UNO, ESP8266 NODEMCU AND HC-SR501 PIR SENSOR",
    "article1Details": "Published in the proceedings of the XXXV International Internet Conference \"Modern Science\", Leeds, United Kingdom, June 16-17, 2022 — pp. 140-143.",
    "publishedBy": "Published by:",
    "view": "[View]"
  },
  "ua": {
    "name": "Юрій Солодовник",
    "developer": "Розробник",
    "resume": "Резюме",
    "aboutMe": "Розробник з практичним досвідом створення та підтримки корпоративних додатків на .NET та Angular. Маю навички з оптимізації продуктивності, інтеграції з зовнішніми системами та міграції застарілих рішень на сучасні архітектури. Маю хороше розуміння масштабованого монолітного дизайну, серверної інфраструктури та оптимізації фронтенду. Практичний, орієнтований на результат і завжди прагну покращити як продукт, так і процеси.",
    "experience": "Досвід",
    "now": "Зараз",
    "th": "е",
    "october": "Жовтень",
    "present": "зараз",
    "workingIn": "Робота в",
    "as": "як",
    "st": "е",
    "rd": "е",
    "clarifyRequirements": "Уточнення складних бізнес-вимог і трансформація їх у технічні рішення",
    "taskDefinitionMonolith": "Визначення та реалізація задач для великого монолітного проєкту (.NET + Angular)",
    "performanceOptimization": "Оптимізація продуктивності фронтенду та бекенду (профілювання, кеш Redis, налаштування SQL)",
    "migrationDotNet": "Міграція з .NET Framework на .NET 8",
    "externalApi": "Розробка та підтримка зовнішніх API та інтеграцій (Stripe, HubSpot, Mailchimp тощо)",
    "studentAt": "Студент",
    "bachelorStudentAt": "Студент бакалаврату",
    "masterStudentAt": "Студент магістратури",
    "nure": "Харківського національного університету радіоелектроніки",
    "faculty": "Факультет Комп'ютерної інженерії та управління,",
    "specialty": "спеціальність Комп'ютерна інженерія.",
    "notToBeConfused": "не плутати з назвою факультету",
    "specialtyMaster": "спеціальність Комп'ютерна інженерія  (Спеціализировані комп'ютерні системы).",
    "advancedKnowledgeInComputerEngineering": "Поглиблені знання в галузі комп’ютерної інженерії, зокрема методів ШІ, аналізу даних, проєктування систем і мереж.",
    "practicalSkillsInSolving": "Практичні навички розв’язання інженерних задач, моделювання систем, аналізу інформації та реалізації проєктів.",
    "criticalThinking": "Критичне мислення та вміння приймати рішення, формулювати проблеми і чітко представляти інформацію, зокрема у науковому середовищі українською та іноземною мовами.",
    "enterpriseProjectDevelopment": "Розробка ентерпрайз проектів для великих систем.",
    "teamCollaboration": "Взаємодія в команді та використання інструментів для безперебійного робочого процесу.",
    "deadlines": "Дедлайни та MVP, пріоритизація завдань, поетапна розробка, складання основного функціоналу.",
    "fundamentalTheoreticalKnowledge": "Базові теоретичні знання про комп’ютерні системи, мережі та технології, включаючи сучасні досягнення комп’ютерної інженерії.",
    "understandingOfPracticalAspects": "Розуміння практичних аспектів, таких як технічні характеристики, моделювання, експерименти та пошук інженерних рішень.",
    "abilityToAssess": "Оцінка впливу технічних рішень у суспільному, економічному, екологічному контексті, а також знання основ економіки та управління проєктами.",
    "basicProgrammingSkills": "Базові навички програмування: алгоритмічне мислення, знання мов програмування, ООП та основи розробки програмного забезпечення.",
    "backThen": "Раніше",
    "june": "Червень",
    "september": "Вересень",
    "february": "Лютий",
    "bsa": "Binary Studio Academy",
    "lyceum": "Пвнютинський ліцей",
    "wayBackThen": "Давно",
    "july": "Липень",
    "born": "Народився",
    "inTheTown": "в селищі",
    "panyutyne": "Панютине",
    "ukraine": "Україна",
    "location": "Локація",
    "problemSolving": "Вирішення проблем",
    "teamworkAndCommunication": "Командна робота та комунікація",
    "timeManagement": "Управління часом",
    "skills": "Навички",
    "frontendSkills": "Фронтенд: Angular, JavaScript/TypeScript, HTML5/CSS3/SASS.",
    "backendSkills": "Бекенд: .NET, ASP.NET Core, EF Core + LINQ, Redis, T-SQL, MongoDb.",
    "softSkills": "Soft skills: Командна робота, Ефективна комунікація, Вирішення проблем, Тайм-менеджмент, Адаптивність, Критичне мислення, Увага до деталей, Врегулювання конфліктів",
    "character": "Характер",
    "characterTraits": "ДИСЦИПЛІНОВАНИЙ СВІДОМИЙ РАЦІОНАЛЬНИЙ УЗГОДЖЕНИЙ ДОПИТЛИВИЙ НІЗКОЕМОЦІОНАЛЬНИЙ СПОКІЙНИЙ ЗАВЗЯТИЙ КОНКУРЕНТНИЙ ПРОКРАСТИНАТОР",
    "likes": "Подобається",
    "likesDescription": "ХОРОША ЇЖА ПОГАНА ЇЖА ФУТБОЛ ВОЛЕЙБОЛ БАСКЕТБОЛ БІГ РОК СОБАКИ ПОДОРОЖІ",
    "dislikes": "Не подобається",
    "dislikesDescription": "ЗЛІСНІ ЛЮДИ НЕСПРАВЕДЛИВІСТЬ ДРАТІВЛИВІСЬ ЛИСІ КОТИ НАРКОТИКИ ЛИЦЕМІРСТВО",
    "wants": "Хочеться",
    "wantsDescription": "СТВОРИТИ СВОЮ ВЛАСНУ КОМПАНІЮ З РОЗРОБКИ ПРОГРАМНОГО ЗАБЕЗПЕЧЕННЯ, БУТИ ПРОФЕСІОНАЛОМ У МОЇЙ СФЕРІ, БУТИ ОСВІЧЕНОЮ ЛЮДИНОЮ, ЗЛІТАТИ НА МАРС",
    "education": "Освіта",
    "everyDay": "Кожен день",
    "everyDayDescription": "Frontend, Backend, Англійська",
    "spentInKindergarten": "Провів в дитячому садку як звичайна дитина",
    "articles": "Статті",
    "article1Title": "РОЗУМНА СИСТЕМА КЕРУВАННЯ ОСВІТЛЕННЯМ В ПРИМІЩЕНІ НА БАЗІ ARDUINO UNO, ESP8266 NODEMCU ТА ІНФРАЧЕРВОНОГО ДАТЧИКА РУХУ HC-SR501",
    "article1Details": "Опубліковано у збірнику матеріалів XXXV Міжнародної інтернет-конференції «Modern Science», м. Лідс, Велика Британія, 16-17 червня 2022 р. — стор. 140-143.",
    "publishedBy": "Видавництво:",
    "view": "[Детальніше]"
  },
  "ru": {
    "name": "Юрий Солодовник",
    "developer": "Разработчик",
    "resume": "Резюме",
    "aboutMe": "Разработчик с практическим опытом создания и поддержки корпоративных приложений на .NET и Angular. Имею навыки в оптимизации производительности, интеграции с внешними системами и миграции устаревших решений на современные архитектуры. Имею хорошее понимание масштабируемого монолитного дизайна, серверной инфраструктуры и оптимизации фронтенда. Практичный, ориентированный на результат и всегда стремлюсь к улучшению как продукта, так и процессов.",
    "experience": "Опыт",
    "now": "Сейчас",
    "th": "е",
    "october": "Октябрь",
    "present": "сейчас",
    "workingIn": "Работа в",
    "as": "как",
    "st": "е",
    "rd": "е",
    "clarifyRequirements": "Уточнение сложных бизнес-требований и трансформация их в технические решения",
    "taskDefinitionMonolith": "Определение и реализация задач для крупного монолитного проекта (.NET + Angular)",
    "performanceOptimization": "Оптимизация производительности фронтенда и бэкенда (профилирование, кеш Redis, настройка SQL)",
    "migrationDotNet": "Миграция с .NET Framework на .NET 8",
    "externalApi": "Разработка и поддержка внешних API и интеграций (Stripe, HubSpot, Mailchimp и др.)",
    "studentAt": "Студент",
    "bachelorStudentAt": "Студент бакалавриата",
    "masterStudentAt": "Студент магистратуры",
    "nure": "Харьковского национального университета радиоэлектроники",
    "faculty": "Факультет Компьютерной инженерии и управления,",
    "specialty": "специальность Компьютерная инженерия.",
    "notToBeConfused": "не путать с названием факультета",
    "specialtyMaster": "специальность Компьютерная инженерия (Специализированные компьютерные системы).",
    "advancedKnowledgeInComputerEngineering": "Углубленные знания в области компьютерной инженерии, включая ИИ, анализ данных и проектирование систем.",
    "practicalSkillsInSolving": "Практические навыки решения инженерных задач, построения моделей, анализа информации и ведения проектов.",
    "criticalThinking": "Критическое мышление и принятие решений, умение формулировать проблемы и чётко излагать информацию на научном уровне на украинском и иностранном языках.",
    "enterpriseProjectDevelopment": "Разработка энтерпрайз проектов для крупных систем.",
    "teamCollaboration": "Взаимодействие в команде и использование инструментов для бесперебойного рабочего процесса.",
    "deadlines": "Дедлайны и MVP, приоритизация задач, поэтапная разработка, составление основного функционала.",
    "fundamentalTheoreticalKnowledge": "Базовые теоретические знания о компьютерных системах, сетях и технологиях, включая современные разработки в области компьютерной инженерии.",
    "understandingOfPracticalAspects": "Понимание практических аспектов, включая технические характеристики, моделирование, проведение экспериментов и поиск инженерных решений.",
    "abilityToAssess": "Оценка влияния технических решений в общественном, экономическом и экологическом контексте, знание основ экономики и управления проектами.",
    "basicProgrammingSkills": "Базовые навыки программирования: алгоритмическое мышление, знание языков программирования, ООП и основы разработки программного обеспечения.",
    "backThen": "Раньше",
    "june": "Июнь",
    "september": "Сентябрь",
    "february": "Февраль",
    "bsa": "Binary Studio Academy",
    "lyceum": "Панютинский лицей",
    "wayBackThen": "Давно",
    "july": "Июль",
    "born": "Родился",
    "inTheTown": "в поселке",
    "panyutyne": "Панютино",
    "ukraine": "Украина",
    "location": "Локация",
    "problemSolving": "Решение проблем",
    "teamworkAndCommunication": "Командная работа и коммуникация",
    "timeManagement": "Управление временем",
    "skills": "Навыки",
    "softSkills": "Гибкие навыки: Работа в команде, Эффективная коммуникация, Решение проблем, Тайм-менеджмент, Адаптивность, Критическое мышление, Внимание к деталям, Разрешение конфликтов",
    "character": "Характер",
    "characterTraits": "ДИСЦИПЛИНИРОВАННЫЙ СОЗНАТЕЛЬНЫЙ РАЦИОНАЛЬНЫЙ СОГЛАСОВАННЫЙ ЛЮБОПЫТНЫЙ НИЗКОЭМОЦИОНАЛЬНЫЙ СПОКОЙНЫЙ УПОРНЫЙ КОНКУРЕНТНЫЙ ПРОКРАСТИНАТОР",
    "likes": "Нравится",
    "likesDescription": "ХОРОШАЯ ЕДА ПЛОХАЯ ЕДА ФУТБОЛ ВОЛЕЙБОЛ БАСКЕТБОЛ БЕГ РОК СОБАКИ ПУТЕШЕСТВИЯ",
    "dislikes": "Не нравится",
    "dislikesDescription": "ЗЛОБНЫЕ ЛЮДИ НЕСПРАВЕДЛИВОСТЬ РАЗДРАЖИТЕЛЬНОСТЬ ЛЫСЫЕ КОШКИ НАРКОТИКИ ЛИЦЕМЕРИЕ",
    "wants": "Хочется",
    "wantsDescription": "СОЗДАТЬ СВОЮ СОБСТВЕННУЮ КОМПАНИЮ ПО РАЗРАБОТКЕ ПРОГРАММНОГО ОБЕСПЕЧЕНИЯ, БЫТЬ ПРОФЕССИОНАЛОМ В МОЕЙ ОБЛАСТИ, БЫТЬ ОБРАЗОВАННЫМ ЧЕЛОВЕКОМ, СЛЕТАТЬ НА МАРС",
    "education": "Образование",
    "everyDay": "Каждый день",
    "everyDayDescription": "Frontend, Backend, Английский",
    "spentInKindergarten": "Провел в садике как обычный ребёнок",
    "articles": "Статьи",
    "article1Title": "УМНАЯ СИСТЕМА УПРАВЛЕНИЯ ОСВЕЩЕНИЕМ В ПОМЕЩЕНИИ НА ОСНОВЕ ARDUINO UNO, ESP8266 NODEMCU И ИК-ДАТЧИКА ДВИЖЕНИЯ HC-SR501",
    "article1Details": "Опубликовано в сборнике материалов XXXV Международной интернет-конференции «Modern Science», Лидс, Великобритания, 16-17 июня 2022 г. — стр. 140-143.",
    "publishedBy": "Издательство:",
    "view": "[Детальнее]"
  }
}
